Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وتبارك الذي له ملك السماوات والأرض وما بينهما وعنده علم الساعة وإليه ترجعون
en: And blessed is He to whom belongs the dominion of the heavens and the earth and whatever is between them and with whom is knowledge of the Hour and to whom you will be returned.

source: ولا يملك الذين يدعون من دونه الشفاعة إلا من شهد بالحق وهم يعلمون
en: And those they invoke besides Him do not possess [power of] intercession; but only those who testify to the truth [can benefit], and they know.

source: ولئن سألتهم من خلقهم ليقولن الله فأنى يؤفكون
en: And if you asked them who created them, they would surely say, "Allah." So how are they deluded?

source: وقيله يا رب إن هؤلاء قوم لا يؤمنون
en: And [Allah acknowledges] his saying, "O my Lord, indeed these are a people who do not believe."

source: فاصفح عنهم وقل سلام فسوف يعلمون
en: So turn aside from them and say, "Peace." But they are going to know.

source: إنا أنزلناه في ليلة مباركة إنا كنا منذرين
en: Indeed, We sent it down during a blessed night. Indeed, We were to warn [mankind].

source: فيها يفرق كل أمر حكيم
en: On that night is made distinct every precise matter -

source: أمرا من عندنا إنا كنا مرسلين
en: [Every] matter [proceeding] from Us. Indeed, We were to send [a messenger]

source: رحمة من ربك إنه هو السميع العليم
en: As mercy from your Lord. Indeed, He is the Hearing, the Knowing.

source: رب السماوات والأرض وما بينهما إن كنتم موقنين
en: Lord of the heavens and the earth and that between them, if you would be certain.

source: لا إله إلا هو يحيي ويميت ربكم ورب آبائكم الأولين
en: There is no deity except Him; He gives life and causes death. [He is] your Lord and the Lord of your first forefathers.

source: بل هم في شك يلعبون
en: But they are in doubt, amusing themselves.

source: فارتقب يوم تأتي السماء بدخان مبين
en: Then watch for the Day when the sky will bring a visible smoke.

source: يغشى الناس هذا عذاب أليم
en: Covering the people; this is a painful torment.

source: ربنا اكشف عنا العذاب إنا مؤمنون
en: [They will say], "Our Lord, remove from us the torment; indeed, we are believers."

source: أنى لهم الذكرى وقد جاءهم رسول مبين
en: How will there be for them a reminder [at that time]? And there had come to them a clear Messenger.

source: ثم تولوا عنه وقالوا معلم مجنون
en: Then they turned away from him and said, "[He was] taught [and is] a madman."

source: إنا كاشفو العذاب قليلا إنكم عائدون
en: Indeed, We will remove the torment for a little. Indeed, you [disbelievers] will return [to disbelief].

source: يوم نبطش البطشة الكبرى إنا منتقمون
en: The Day We will strike with the greatest assault, indeed, We will take retribution.

source: ولقد فتنا قبلهم قوم فرعون وجاءهم رسول كريم
en: And We had already tried before them the people of Pharaoh, and there came to them a noble messenger,

source: أن أدوا إلي عباد الله إني لكم رسول أمين
en: [Saying], "Render to me the servants of Allah. Indeed, I am to you a trustworthy messenger,"

source: وأن لا تعلوا على الله إني آتيكم بسلطان مبين
en: And [saying], "Be not haughty with Allah. Indeed, I have come to you with clear authority.

source: وإني عذت بربي وربكم أن ترجمون
en: And indeed, I have sought refuge in my Lord and your Lord, lest you stone me.

source: وإن لم تؤمنوا لي فاعتزلون
en: But if you do not believe me, then leave me alone."

source: فدعا ربه أن هؤلاء قوم مجرمون
en: And [finally] he called to his Lord that these were a criminal people.

source: فأسر بعبادي ليلا إنكم متبعون
en: [Allah said], "Then set out with My servants by night. Indeed, you are to be pursued.

source: واترك البحر رهوا إنهم جند مغرقون
en: And leave the sea in stillness. Indeed, they are an army to be drowned."

source: كم تركوا من جنات وعيون
en: How much they left behind of gardens and springs

source: وزروع ومقام كريم
en: And crops and noble sites

source: ونعمة كانوا فيها فاكهين
en: And comfort wherein they were amused.

source: كذلك وأورثناها قوما آخرين
en: Thus. And We caused to inherit it another people.

source: فما بكت عليهم السماء والأرض وما كانوا منظرين
en: And the heaven and earth wept not for them, nor were they reprieved.

source: ولقد نجينا بني إسرائيل من العذاب المهين
en: And We certainly saved the Children of Israel from the humiliating torment -

source: من فرعون إنه كان عاليا من المسرفين
en: From Pharaoh. Indeed, he was a haughty one among the transgressors.

source: ولقد اخترناهم على علم على العالمين
en: And We certainly chose them by knowledge over [all] the worlds.

source: وآتيناهم من الآيات ما فيه بلاء مبين
en: And We gave them of signs that in which there was a clear trial.

source: إن هؤلاء ليقولون
en: Indeed, these [disbelievers] are saying,

source: إن هي إلا موتتنا الأولى وما نحن بمنشرين
en: "There is not but our first death, and we will not be resurrected.

source: فأتوا بآبائنا إن كنتم صادقين
en: Then bring [back] our forefathers, if you should be truthful."

source: أهم خير أم قوم تبع والذين من قبلهم أهلكناهم إنهم كانوا مجرمين
en: Are they better or the people of Tubba' and those before them? We destroyed them, [for] indeed, they were criminals.

source: وما خلقنا السماوات والأرض وما بينهما لاعبين
en: And We did not create the heavens and earth and that between them in play.

source: ما خلقناهما إلا بالحق ولكن أكثرهم لا يعلمون
en: We did not create them except in truth, but most of them do not know.

source: إن يوم الفصل ميقاتهم أجمعين
en: Indeed, the Day of Judgement is the appointed time for them all -

source: يوم لا يغني مولى عن مولى شيئا ولا هم ينصرون
en: The Day when no relation will avail a relation at all, nor will they be helped -

source: إلا من رحم الله إنه هو العزيز الرحيم
en: Except those [believers] on whom Allah has mercy. Indeed, He is the Exalted in Might, the Merciful.

source: إن شجرت الزقوم
en: Indeed, the tree of zaqqum

source: طعام الأثيم
en: Is food for the sinful.

source: كالمهل يغلي في البطون
en: Like murky oil, it boils within bellies

source: كغلي الحميم
en: Like the boiling of scalding water.

source: خذوه فاعتلوه إلى سواء الجحيم
en: [It will be commanded], "Seize him and drag him into the midst of the Hellfire,

source: ثم صبوا فوق رأسه من عذاب الحميم
en: Then pour over his head from the torment of scalding water."

source: ذق إنك أنت العزيز الكريم
en: [It will be said], "Taste! Indeed, you are the honored, the noble!

source: إن هذا ما كنتم به تمترون
en: Indeed, this is what you used to dispute."

source: إن المتقين في مقام أمين
en: Indeed, the righteous will be in a secure place;

source: يلبسون من سندس وإستبرق متقابلين
en: Wearing [garments of] fine silk and brocade, facing each other.

source: كذلك وزوجناهم بحور عين
en: Thus. And We will marry them to fair women with large, [beautiful] eyes.

source: يدعون فيها بكل فاكهة آمنين
en: They will call therein for every [kind of] fruit - safe and secure.

source: لا يذوقون فيها الموت إلا الموتة الأولى ووقاهم عذاب الجحيم
en: They will not taste death therein except the first death, and He will have protected them from the punishment of Hellfire

source: فضلا من ربك ذلك هو الفوز العظيم
en: As bounty from your Lord. That is what is the great attainment.

source: فإنما يسرناه بلسانك لعلهم يتذكرون
en: And indeed, We have eased the Qur'an in your tongue that they might be reminded.

source: فارتقب إنهم مرتقبون
en: So watch, [O Muhammad]; indeed, they are watching [for your end].

source: إن في السماوات والأرض لآيات للمؤمنين
en: Indeed, within the heavens and earth are signs for the believers.

source: وفي خلقكم وما يبث من دابة آيات لقوم يوقنون
en: And in the creation of yourselves and what He disperses of moving creatures are signs for people who are certain [in faith].

source: واختلاف الليل والنهار وما أنزل الله من السماء من رزق فأحيا به الأرض بعد موتها وتصريف الرياح آيات لقوم يعقلون
en: And [in] the alternation of night and day and [in] what Allah sends down from the sky of provision and gives life thereby to the earth after its lifelessness and [in His] directing of the winds are signs for a people who reason.

source: تلك آيات الله نتلوها عليك بالحق فبأي حديث بعد الله وآياته يؤمنون
en: These are the verses of Allah which We recite to you in truth. Then in what statement after Allah and His verses will they believe?

source: ويل لكل أفاك أثيم
en: Woe to every sinful liar

source: يسمع آيات الله تتلى عليه ثم يصر مستكبرا كأن لم يسمعها فبشره بعذاب أليم
en: Who hears the verses of Allah recited to him, then persists arrogantly as if he had not heard them. So give him tidings of a painful punishment.

source: وإذا علم من آياتنا شيئا اتخذها هزوا أولئك لهم عذاب مهين
en: And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.

source: من ورائهم جهنم ولا يغني عنهم ما كسبوا شيئا ولا ما اتخذوا من دون الله أولياء ولهم عذاب عظيم
en: Before them is Hell, and what they had earned will not avail them at all nor what they had taken besides Allah as allies. And they will have a great punishment.

source: هذا هدى والذين كفروا بآيات ربهم لهم عذاب من رجز أليم
en: This [Qur'an] is guidance. And those who have disbelieved in the verses of their Lord will have a painful punishment of foul nature.

source: الله الذي سخر لكم البحر لتجري الفلك فيه بأمره ولتبتغوا من فضله ولعلكم تشكرون
en: It is Allah who subjected to you the sea so that ships may sail upon it by His command and that you may seek of His bounty; and perhaps you will be grateful.

source: وسخر لكم ما في السماوات وما في الأرض جميعا منه إن في ذلك لآيات لقوم يتفكرون
en: And He has subjected to you whatever is in the heavens and whatever is on the earth - all from Him. Indeed in that are signs for a people who give thought.

source: قل للذين آمنوا يغفروا للذين لا يرجون أيام الله ليجزي قوما بما كانوا يكسبون
en: Say, [O Muhammad], to those who have believed that they [should] forgive those who expect not the days of Allah so that He may recompense a people for what they used to earn.

source: من عمل صالحا فلنفسه ومن أساء فعليها ثم إلى ربكم ترجعون
en: Whoever does a good deed - it is for himself; and whoever does evil - it is against the self. Then to your Lord you will be returned.

source: ولقد آتينا بني إسرائيل الكتاب والحكم والنبوة ورزقناهم من الطيبات وفضلناهم على العالمين
en: And We did certainly give the Children of Israel the Scripture and judgement and prophethood, and We provided them with good things and preferred them over the worlds.

source: وآتيناهم بينات من الأمر فما اختلفوا إلا من بعد ما جاءهم العلم بغيا بينهم إن ربك يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون
en: And We gave them clear proofs of the matter [of religion]. And they did not differ except after knowledge had come to them - out of jealous animosity between themselves. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.

source: ثم جعلناك على شريعة من الأمر فاتبعها ولا تتبع أهواء الذين لا يعلمون
en: Then We put you, [O Muhammad], on an ordained way concerning the matter [of religion]; so follow it and do not follow the inclinations of those who do not know.

source: إنهم لن يغنوا عنك من الله شيئا وإن الظالمين بعضهم أولياء بعض والله ولي المتقين
en: Indeed, they will never avail you against Allah at all. And indeed, the wrongdoers are allies of one another; but Allah is the protector of the righteous.

source: هذا بصائر للناس وهدى ورحمة لقوم يوقنون
en: This [Qur'an] is enlightenment for mankind and guidance and mercy for a people who are certain [in faith].

source: أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم ساء ما يحكمون
en: Or do those who commit evils think We will make them like those who have believed and done righteous deeds - [make them] equal in their life and their death? Evil is that which they judge.

source: وخلق الله السماوات والأرض بالحق ولتجزى كل نفس بما كسبت وهم لا يظلمون
en: And Allah created the heavens and earth in truth and so that every soul may be recompensed for what it has earned, and they will not be wronged.

source: أفرأيت من اتخذ إلهه هواه وأضله الله على علم وختم على سمعه وقلبه وجعل على بصره غشاوة فمن يهديه من بعد الله أفلا تذكرون
en: Have you seen he who has taken as his god his [own] desire, and Allah has sent him astray due to knowledge and has set a seal upon his hearing and his heart and put over his vision a veil? So who will guide him after Allah? Then will you not be reminded?

source: وقالوا ما هي إلا حياتنا الدنيا نموت ونحيا وما يهلكنا إلا الدهر وما لهم بذلك من علم إن هم إلا يظنون
en: And they say, "There is not but our worldly life; we die and live, and nothing destroys us except time." And they have of that no knowledge; they are only assuming.

source: وإذا تتلى عليهم آياتنا بينات ما كان حجتهم إلا أن قالوا ائتوا بآبائنا إن كنتم صادقين
en: And when Our verses are recited to them as clear evidences, their argument is only that they say, "Bring [back] our forefathers, if you should be truthful."

source: قل الله يحييكم ثم يميتكم ثم يجمعكم إلى يوم القيامة لا ريب فيه ولكن أكثر الناس لا يعلمون
en: Say, "Allah causes you to live, then causes you to die; then He will assemble you for the Day of Resurrection, about which there is no doubt, but most of the people do not know."

source: ولله ملك السماوات والأرض ويوم تقوم الساعة يومئذ يخسر المبطلون
en: And to Allah belongs the dominion of the heavens and the earth. And the Day the Hour appears - that Day the falsifiers will lose.

source: وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون
en: And you will see every nation kneeling [from fear]. Every nation will be called to its record [and told], "Today you will be recompensed for what you used to do.

source: هذا كتابنا ينطق عليكم بالحق إنا كنا نستنسخ ما كنتم تعملون
en: This, Our record, speaks about you in truth. Indeed, We were having transcribed whatever you used to do."

source: فأما الذين آمنوا وعملوا الصالحات فيدخلهم ربهم في رحمته ذلك هو الفوز المبين
en: So as for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is what is the clear attainment.

source: وأما الذين كفروا أفلم تكن آياتي تتلى عليكم فاستكبرتم وكنتم قوما مجرمين
en: But as for those who disbelieved, [it will be said], "Were not Our verses recited to you, but you were arrogant and became a people of criminals?

source: وإذا قيل إن وعد الله حق والساعة لا ريب فيها قلتم ما ندري ما الساعة إن نظن إلا ظنا وما نحن بمستيقنين
en: And when it was said, 'Indeed, the promise of Allah is truth and the Hour [is coming] - no doubt about it,' you said, 'We know not what is the Hour. We assume only assumption, and we are not convinced.' "

source: وبدا لهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون
en: And the evil consequences of what they did will appear to them, and they will be enveloped by what they used to ridicule.

source: وقيل اليوم ننساكم كما نسيتم لقاء يومكم هذا ومأواكم النار وما لكم من ناصرين
en: And it will be said, "Today We will forget you as you forgot the meeting of this Day of yours, and your refuge is the Fire, and for you there are no helpers.

source: ذلكم بأنكم اتخذتم آيات الله هزوا وغرتكم الحياة الدنيا فاليوم لا يخرجون منها ولا هم يستعتبون
en: That is because you took the verses of Allah in ridicule, and worldly life deluded you." So that Day they will not be removed from it, nor will they be asked to appease [Allah].

source: فلله الحمد رب السماوات ورب الأرض رب العالمين
en: Then, to Allah belongs [all] praise - Lord of the heavens and Lord of the earth, Lord of the worlds.

source: وله الكبرياء في السماوات والأرض وهو العزيز الحكيم
en: And to Him belongs [all] grandeur within the heavens and the earth, and He is the Exalted in Might, the Wise.

source: ما خلقنا السماوات والأرض وما بينهما إلا بالحق وأجل مسمى والذين كفروا عما أنذروا معرضون
en: We did not create the heavens and earth and what is between them except in truth and [for] a specified term. But those who disbelieve, from that of which they are warned, are turning away.

source: قل أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات ائتوني بكتاب من قبل هذا أو أثارة من علم إن كنتم صادقين
en: Say, [O Muhammad], "Have you considered that which you invoke besides Allah? Show me what they have created of the earth; or did they have partnership in [creation of] the heavens? Bring me a scripture [revealed] before this or a [remaining] trace of knowledge, if you should be truthful."

source: ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون
en: And who is more astray than he who invokes besides Allah those who will not respond to him until the Day of Resurrection, and they, of their invocation, are unaware.

source: وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين
en: And when the people are gathered [that Day], they [who were invoked] will be enemies to them, and they will be deniers of their worship.

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للحق لما جاءهم هذا سحر مبين
en: And when Our verses are recited to them as clear evidences, those who disbelieve say of the truth when it has come to them, "This is obvious magic."

source: أم يقولون افتراه قل إن افتريته فلا تملكون لي من الله شيئا هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم وهو الغفور الرحيم
en: Or do they say, "He has invented it?" Say, "If I have invented it, you will not possess for me [the power of protection] from Allah at all. He is most knowing of that in which you are involved. Sufficient is He as Witness between me and you, and He is the Forgiving the Merciful."

source: قل ما كنت بدعا من الرسل وما أدري ما يفعل بي ولا بكم إن أتبع إلا ما يوحى إلي وما أنا إلا نذير مبين
en: Say, "I am not something original among the messengers, nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am not but a clear warner."

source: قل أرأيتم إن كان من عند الله وكفرتم به وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين
en: Say, "Have you considered: if the Qur'an was from Allah, and you disbelieved in it while a witness from the Children of Israel has testified to something similar and believed while you were arrogant...?" Indeed, Allah does not guide the wrongdoing people.

source: وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه وإذ لم يهتدوا به فسيقولون هذا إفك قديم
en: And those who disbelieve say of those who believe, "If it had [truly] been good, they would not have preceded us to it." And when they are not guided by it, they will say, "This is an ancient falsehood."

source: ومن قبله كتاب موسى إماما ورحمة وهذا كتاب مصدق لسانا عربيا لينذر الذين ظلموا وبشرى للمحسنين
en: And before it was the scripture of Moses to lead and as a mercy. And this is a confirming Book in an Arabic tongue to warn those who have wronged and as good tidings to the doers of good.

source: إن الذين قالوا ربنا الله ثم استقاموا فلا خوف عليهم ولا هم يحزنون
en: Indeed, those who have said, "Our Lord is Allah," and then remained on a right course - there will be no fear concerning them, nor will they grieve.

source: أولئك أصحاب الجنة خالدين فيها جزاء بما كانوا يعملون
en: Those are the companions of Paradise, abiding eternally therein as reward for what they used to do.

source: ووصينا الإنسان بوالديه إحسانا حملته أمه كرها ووضعته كرها وحمله وفصاله ثلاثون شهرا حتى إذا بلغ أشده وبلغ أربعين سنة قال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأصلح لي في ذريتي إني تبت إليك وإني من المسلمين
en: And We have enjoined upon man, to his parents, good treatment. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning [period] is thirty months. [He grows] until, when he reaches maturity and reaches [the age of] forty years, he says, "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims."

source: أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون
en: Those are the ones from whom We will accept the best of what they did and overlook their misdeeds, [their being] among the companions of Paradise. [That is] the promise of truth which they had been promised.

source: والذي قال لوالديه أف لكما أتعدانني أن أخرج وقد خلت القرون من قبلي وهما يستغيثان الله ويلك آمن إن وعد الله حق فيقول ما هذا إلا أساطير الأولين
en: But one who says to his parents, "Uff to you; do you promise me that I will be brought forth [from the earth] when generations before me have already passed on [into oblivion]?" while they call to Allah for help [and to their son], "Woe to you! Believe! Indeed, the promise of Allah is truth." But he says, "This is not but legends of the former people" -

source: أولئك الذين حق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين
en: Those are the ones upon whom the word has come into effect, [who will be] among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.

source: ولكل درجات مما عملوا وليوفيهم أعمالهم وهم لا يظلمون
en: And for all there are degrees [of reward and punishment] for what they have done, and [it is] so that He may fully compensate them for their deeds, and they will not be wronged.

source: ويوم يعرض الذين كفروا على النار أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون بما كنتم تستكبرون في الأرض بغير الحق وبما كنتم تفسقون
en: And the Day those who disbelieved are exposed to the Fire [it will be said], "You exhausted your pleasures during your worldly life and enjoyed them, so this Day you will be awarded the punishment of [extreme] humiliation because you were arrogant upon the earth without right and because you were defiantly disobedient."

source: واذكر أخا عاد إذ أنذر قومه بالأحقاف وقد خلت النذر من بين يديه ومن خلفه ألا تعبدوا إلا الله إني أخاف عليكم عذاب يوم عظيم
en: And mention, [O Muhammad], the brother of 'Aad, when he warned his people in the [region of] al-Ahqaf - and warners had already passed on before him and after him - [saying], "Do not worship except Allah. Indeed, I fear for you the punishment of a terrible day."

source: قالوا أجئتنا لتأفكنا عن آلهتنا فأتنا بما تعدنا إن كنت من الصادقين
en: They said, "Have you come to delude us away from our gods? Then bring us what you promise us, if you should be of the truthful."

source: قال إنما العلم عند الله وأبلغكم ما أرسلت به ولكني أراكم قوما تجهلون
en: He said, "Knowledge [of its time] is only with Allah, and I convey to you that with which I was sent; but I see you [to be] a people behaving ignorantly."

source: فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا بل هو ما استعجلتم به ريح فيها عذاب أليم
en: And when they saw it as a cloud approaching their valleys, they said, "This is a cloud bringing us rain!" Rather, it is that for which you were impatient: a wind, within it a painful punishment,

source: تدمر كل شيء بأمر ربها فأصبحوا لا يرى إلا مساكنهم كذلك نجزي القوم المجرمين
en: Destroying everything by command of its Lord. And they became so that nothing was seen [of them] except their dwellings. Thus do We recompense the criminal people.

source: ولقد مكناهم فيما إن مكناكم فيه وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله وحاق بهم ما كانوا به يستهزئون
en: And We had certainly established them in such as We have not established you, and We made for them hearing and vision and hearts. But their hearing and vision and hearts availed them not from anything [of the punishment] when they were [continually] rejecting the signs of Allah; and they were enveloped by what they used to ridicule.

source: ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون
en: And We have already destroyed what surrounds you of [those] cities, and We have diversified the signs [or verses] that perhaps they might return [from disbelief].
